# 6. Deep In Panndas

# 数据处理的三个阶段

* 数据准备   
* 数据转换   
* 数据聚合

## 6.1 数据准备
将数据组装成便于用pandas处理的数据结构，包括以下步骤：    
* 加载   
* 组装 
 > 合并 ( merging ) ---- pandas.merge( ) 根据一个/多个键连接多行     
 > 拼接 ( concantenation ) ---- pandas.concat( ) 按照轴把多个对象拼接起来      
 > 组合 ( combine ) ---- pandas.DataFrame.combine_first( ) 从另外一个数据结构获取数据，连接重合的数据，以填充缺失值      
* 变形（轴向旋转）     
* 删除      

### 合并

* 相当于SQL中的JOIN操作

In [1]:
import numpy as np
import pandas as pd
frame1 = pd.DataFrame({'id':['ball','pencil','pen','mug','ashtray'],
                      'price':[12.33,11.44,33.21,13.23,33.62]})
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [2]:
frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'],
                      'color':['w','r','r','k']})
frame2

  color      id
0     w  pencil
1     r  pencil
2     r    ball
3     k     pen

In [3]:
pd.merge(frame1,frame2)

       id  price color
0    ball  12.33     r
1  pencil  11.44     w
2  pencil  11.44     r
3     pen  33.21     k

In [4]:
frame1 = pd.DataFrame({'id':['ball','pencil','pen','mug','ashtray'],
                      'color':['w','r','r','k','g'],
                      'brand':['OMG','ABC','ABC','POD','POD']})
frame1

  brand color       id
0   OMG     w     ball
1   ABC     r   pencil
2   ABC     r      pen
3   POD     k      mug
4   POD     g  ashtray

In [5]:
frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'],
                      'brand':['OMG','POD','ABC','POD']})
frame2

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [6]:
pd.merge(frame1,frame2)

Empty DataFrame
Columns: [brand, color, id]
Index: []

In [7]:
pd.merge(frame1,frame2,on='id')

  brand_x color      id brand_y
0     OMG     w    ball     ABC
1     ABC     r  pencil     OMG
2     ABC     r  pencil     POD
3     ABC     r     pen     POD

In [8]:
pd.merge(frame1,frame2,on='brand')

  brand color     id_x    id_y
0   OMG     w     ball  pencil
1   ABC     r   pencil    ball
2   ABC     r      pen    ball
3   POD     k      mug  pencil
4   POD     k      mug     pen
5   POD     g  ashtray  pencil
6   POD     g  ashtray     pen

* 合并标准不同，结果差异很大   
* 如果DataFrame 基准列名称不一致，    
 用left-on 和 right_on指定第一/二个DataFrame的基准列

In [9]:
frame2.columns = ['brand','sid']
frame2

  brand     sid
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [10]:
pd.merge(frame1,frame2,left_on='id',right_on='sid')

  brand_x color      id brand_y     sid
0     OMG     w    ball     ABC    ball
1     ABC     r  pencil     OMG  pencil
2     ABC     r  pencil     POD  pencil
3     ABC     r     pen     POD     pen

* merge( )默认执行的是**内连接操作**    
* 上述结果中的键是**由交叉操作( intersection )**得到的    
 其他选项有**左连接、右连接、外连接**；连接类型用 how 指定

> frame2.colmns = ['brand','id']     
> pd.merge(frame1,frame2,on='id')    
> * 辣鸡！都是bug    // **key error 'id'** //

* 要合并多个键，把多个键赋给 on 选项

> pd.merge(frame1,frame2,on=['id','brand'],how='outer')
> * 辣鸡！还是bug // **key error 'id'** //

* 根据索引合并   
 有时合并操作不是用DataFrame的列，而是用索引作为键。把left_index和right_index的值设为True，即可。
> pd.merge(frame1,frame2,right_index=True,left_index=True)

* 但是DataFrame对象的join()更适合根据索引合并，可以用来合并多个索引相同/索引相同但列不同的DF对象。    
> frame2.columns = ['brand2','id2']      
> frame1.join(frame2)

## 6.2 拼接

拼接（concatenation）

In [11]:
array1 = np.array([[0,1,2],
                   [3,4,5],
                   [6,7,8]])
array2 = np.array([[6,7,8], 
                   [9,10,11],
                   [12,13,14]])
np.concatenate([array1,array2],axis=1)

array([[ 0,  1,  2,  6,  7,  8],
       [ 3,  4,  5,  9, 10, 11],
       [ 6,  7,  8, 12, 13, 14]])

In [12]:
np.concatenate([array1,array2],axis=0)

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

* 带编号的轴，可进一步拓展数组拼接功能。pandas的concat( )实现了按轴拼接的功能。

In [13]:
ser1 = pd.Series(np.random.rand(4),index=[1,2,3,4])
ser1

1    0.399921
2    0.076116
3    0.642045
4    0.419668
dtype: float64

In [14]:
ser2 = pd.Series(np.random.rand(4),index=[5,6,7,8])
ser2

5    0.552892
6    0.161829
7    0.799039
8    0.590747
dtype: float64

In [15]:
pd.concat([ser1,ser2])

1    0.399921
2    0.076116
3    0.642045
4    0.419668
5    0.552892
6    0.161829
7    0.799039
8    0.590747
dtype: float64

concat( )默认按照axis=0这条轴拼接数据，返回Series对象。如果指定axis=1，返回结果将是DataFrame对象。

In [16]:
ser3=pd.concat([ser1,ser2],axis=1)
ser3

          0         1
1  0.399921       NaN
2  0.076116       NaN
3  0.642045       NaN
4  0.419668       NaN
5       NaN  0.552892
6       NaN  0.161829
7       NaN  0.799039
8       NaN  0.590747

* 结果中无重回数据，因而刚执行的是**外连接操作**。把join 设置为'inner'，可执行**内连接操作**。

In [17]:
pd.concat([ser1,ser3],axis=1,join='inner')

          0         0   1
1  0.399921  0.399921 NaN
2  0.076116  0.076116 NaN
3  0.642045  0.642045 NaN
4  0.419668  0.419668 NaN

此操作的问题是，从结果中无法识被拼接的部分。如果在用于拼接的轴上创建等级索引，需要借助keys来完成。

In [18]:
pd.concat([ser1,ser2],keys=[1,2])

1  1    0.399921
   2    0.076116
   3    0.642045
   4    0.419668
2  5    0.552892
   6    0.161829
   7    0.799039
   8    0.590747
dtype: float64

按照axis=1拼接Series对象，所指定的键变为拼接后得到的DataFrame对象各列的名称。

In [19]:
pd.concat([ser1,ser2],axis=1,keys=[1,2])

          1         2
1  0.399921       NaN
2  0.076116       NaN
3  0.642045       NaN
4  0.419668       NaN
5       NaN  0.552892
6       NaN  0.161829
7       NaN  0.799039
8       NaN  0.590747

* DataFrame对象拼接方法与之相同

### 6.2.1 组合

* 当无法通过合并或者拼接方法组合数据，比如两个数据集的索引完全/部分重合。    
 combine_first( ) 可以用来组合Series对象，同时对其数据。

In [20]:
ser1 = pd.Series(np.random.rand(5),index=[1,2,3,4,5])
ser1

1    0.865614
2    0.372295
3    0.925969
4    0.130369
5    0.847461
dtype: float64

In [21]:
ser2 = pd.Series(np.random.rand(4),index=[2,4,5,6])
ser2

2    0.502107
4    0.517182
5    0.579815
6    0.386595
dtype: float64

In [22]:
ser1.combine_first(ser2)

1    0.865614
2    0.372295
3    0.925969
4    0.130369
5    0.847461
6    0.386595
dtype: float64

In [23]:
ser2.combine_first(ser1)

1    0.865614
2    0.502107
3    0.925969
4    0.517182
5    0.579815
6    0.386595
dtype: float64

如果要部分合并，只要指定合并中的部分即可

In [24]:
ser1[:3].combine_first(ser2[:3])

1    0.865614
2    0.372295
3    0.925969
4    0.517182
5    0.579815
dtype: float64

### 6.2.2 轴向旋转

轴向旋转（pivoting）

* 按等级索引旋转   
 包含两个基础操作：   
 > 入栈（stacking）：转换数据结构，列变为行。   
 > 出栈（unstacking）：把行转为列。

In [25]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                      index=['w','k','r'],
                      columns=['ball','pen','pencil'])
frame1

   ball  pen  pencil
w     0    1       2
k     3    4       5
r     6    7       8

对DataFrame使用stack( )，会把列转变成行，得到Series对象。

In [26]:
ser5 = frame1.stack()
ser5

w  ball      0
   pen       1
   pencil    2
k  ball      3
   pen       4
   pencil    5
r  ball      6
   pen       7
   pencil    8
dtype: int64

In [27]:
ser5.unstack()

   ball  pen  pencil
w     0    1       2
k     3    4       5
r     6    7       8

出栈操作可以应用于不同层级，为unstack( )传入层级的编号或名称，即可对相应层级进行操作。

In [28]:
ser5.unstack(0)

        w  k  r
ball    0  3  6
pen     1  4  7
pencil  2  5  8

## 6.3 数据转换

### 6.3.1 删除重复元素

In [29]:
dframe = pd.DataFrame({'color':['w','w','r','r','w'],
                        'value':[2,1,3,3,2]})
dframe

  color  value
0     w      2
1     w      1
2     r      3
3     r      3
4     w      2

* duplicated( )用来检测重复的行，返回元素为bool的Series对象。   
 每个元素对应一行，如果和其他行重复，为True；如果不重复，为False。

In [30]:
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

过滤操作：

In [31]:
dframe[dframe.duplicated()]

  color  value
3     r      3
4     w      2

通常，重复的行都需要从DataFrame删除，drop_duplicates( )实现了删除功能，返回的都是删除重复行后的DataFrane对象。

> tokens = [s.strip( ) for s in text.split(',')]

### 6.3.2 映射

定义映射关系，最好用dict。    
* 都以dict对象为参数    
 > replace( ): 替换元素    
 > map( ): 新建一列     
 > rename( ): 替换索引    
 
> frame.replace(newcolors)      
> ser = pd.replace(np.nan,0)      
> frame['price'] = frame['item'].map(price)     
> frame.rename(reindex)     
> frame.rename(index={1;'first},columns={'item':'object'})

## 6.4 离散化和面元划分

在处理大量连续型数据时，为便于区分，需要把数据打散成几个类别，比如把读书的取值范围划分为一个个小区间，统计每个区间的元素数量或其他统计量；另一种情况是，对总体作出精确的测量，得到了大量个体这种情况下需要把元素分成几个类别，然后分析每个类别的个体数量及其他统计量。

* 已知实验数据范围0～100，所以可以把数据均分；例如分成四部分，即四个**面元（bin）**。     
 第一个面元包含0～25的值，第二个为26～50，第三个为51～75，最后一个为76～100.   
 用pandas划分面元之前首先要定义一个数组result，储存用于面元划分的各数值。   
 然后，对result数组用cut( )函数，同时传入bins变量作为参数。

In [32]:
result = range(0,101)
bins=[0,25,50,75,100]
cat = pd.cut(result,bins)
cat

[NaN, (0, 25], (0, 25], (0, 25], (0, 25], ..., (75, 100], (75, 100], (75, 100], (75, 100], (75, 100]]
Length: 101
Categories (4, interval[int64]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [33]:
pd.value_counts(cat)

(75, 100]    25
(50, 75]     25
(25, 50]     25
(0, 25]      25
dtype: int64

cut( )函数返回的对象为Categorical（类别型）类型，可以看作一个字符串数组，元素为面元名称。   
该对象内部levels数组为不同内部类别的名称，labels数组的元素数量和results数组相同，labels数组各数字表示results元素所属面元。

除了cut( )函数，还有另一个划分面元的函数qcut( )，用此函数划分的函数能保证每个面元个体数相同，但每个面元的区间大小不等。

In [34]:
quintiles = pd.qcut(result,5)
quintiles

[(-0.001, 20.0], (-0.001, 20.0], (-0.001, 20.0], (-0.001, 20.0], (-0.001, 20.0], ..., (80.0, 100.0], (80.0, 100.0], (80.0, 100.0], (80.0, 100.0], (80.0, 100.0]]
Length: 101
Categories (5, interval[float64]): [(-0.001, 20.0] < (20.0, 40.0] < (40.0, 60.0] < (60.0, 80.0] < (80.0, 100.0]]

In [35]:
pd.value_counts(quintiles)

(-0.001, 20.0]    21
(80.0, 100.0]     20
(60.0, 80.0]      20
(40.0, 60.0]      20
(20.0, 40.0]      20
dtype: int64

* **异常值检测和过滤**

* **etc**    
 先创建一个包含三列的DataFrame对象，每列都包含1000个随机数。   
 用describe( )查看统计量：

In [36]:
randframe = pd.DataFrame(np.random.randn(1000,3))
randframe.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.056358     0.025794    -0.015575
std       1.002482     1.003585     0.960349
min      -3.112580    -3.223901    -3.234115
25%      -0.620683    -0.637269    -0.664252
50%       0.035661     0.033352    -0.021866
75%       0.692124     0.694613     0.656074
max       3.523428     2.710260     2.869098

假设将比std大3倍大元素视为异常值，用std( )可以求的DataFrame对象每一列的标准差。

In [37]:
randframe.std()

0    1.002482
1    1.003585
2    0.960349
dtype: float64

根据每一列的标准差，对DF对象所有元素进行过滤，借助any( )，就可以对每列应用筛选条件。

In [38]:
randframe[(np.abs(randframe)>(3*randframe.std())).any(1)]

            0         1         2
107  3.133253 -0.654378  1.455495
189  0.934462  0.000348 -3.040142
242 -0.291509 -3.075147  0.110602
421 -3.062809 -1.999317 -0.683621
426  3.523428 -0.468318 -0.794309
607 -2.093827 -3.223901 -0.484205
674  3.195850  1.379003 -0.114405
759  3.341688 -0.443194  1.500264
855 -0.237716  1.188255 -3.234115
894 -3.112580  0.251672  0.862399

## 排序

* 用numpy.random.permutation( )，调整Series对象或者DataFrame对象各行的顺序（随机排序）。     
* 创建一个元素为整数且按照升序排列的DF对象。

In [39]:
nframe = pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

* 用permutation( )创建一个包含0～4（顺序随机）这五个整数的数组。     
 按此数组元素的顺序为DF对象的行排序。

In [40]:
new_order = np.random.permutation(5)
new_order

array([4, 1, 3, 2, 0])

* 对DF对象的所有行应用take( )函数，把新的次序传给它。

In [41]:
nframe.take(new_order)

    0   1   2   3   4
4  20  21  22  23  24
1   5   6   7   8   9
3  15  16  17  18  19
2  10  11  12  13  14
0   0   1   2   3   4

DF对象各行位置已经改变，新索引的顺序和new_orde数组元素顺序一致。   
* 还可以只对DF对象的一部分进行排序操作，将生成一个数组，只包含特定索引范围的数据。

In [42]:
new_order = [3,4,2]
nframe.take(new_order)

    0   1   2   3   4
3  15  16  17  18  19
4  20  21  22  23  24
2  10  11  12  13  14

### 随机取样

* 从大规模DF中**随机取样**，最快的方法：np.random.randint( )

In [43]:
sample = np.random.randint(0,len(nframe),size=3)
sample

array([2, 0, 2])

In [44]:
nframe.take(sample)

    0   1   2   3   4
2  10  11  12  13  14
0   0   1   2   3   4
2  10  11  12  13  14

## 6.6 字符串处理

### 6.6.1 内置的字符串处理方法

In [45]:
text = '16 Bolton Avenue , Boston '
text.split(',')

['16 Bolton Avenue ', ' Boston ']

切分后的第一个元素常以空白字符结尾，因此为解决这个问题：
* 用**split( )**切分后，再用**strip( )**删除多余**空白字符，换行符**

In [46]:
token = [s.strip() for s in text.split(',')]
token

['16 Bolton Avenue', 'Boston']

如果元素较少且固定不变，可使用以下赋值方法

In [47]:
address, city = [s.strip() for s in text.split(',')]
address

'16 Bolton Avenue'

In [48]:
city

'Boston'

* 通常还需要其逆操作，把多个字符串拼接在一起练成长文本。
* 最简单的方法是用‘+’运算符把几个文本片段拼接在一起，适用于只有两三个字符串。

In [49]:
address+','+city

'16 Bolton Avenue,Boston'

* 如要拼接很多字符串，更实用的方法是用join( )函数

In [50]:
strings = ['A+','A','A-','B','BB','BBB','C+']
';'.join(strings)

'A+;A;A-;B;BB;BBB;C+'

另一类是查找子串，in 关键字是检测子串最好方法。    
index( ) 和find( )能实现字符串查找。

In [51]:
'Boston' in text

True

In [52]:
text.index('Boston')

19

In [53]:
text.find('Boston')

19

这两个函数均返回子串在字符串中的索引，但是在没有找到子串时表现不同。   
* index( )会报错，find( )返回-1.
* 用count( )函数获知字符或者字符串组合在文本中出现次数。

In [54]:
text.count('e')

2

In [55]:
text.count('Avenue')

1

针对字符串的另一个操作是替换或删除字符串中的子串/单个字符。   
都可以用replace( )函数实现，如用空字符替代子串等同于删除子串。

In [56]:
text.replace('Avenue','Street')

'16 Bolton Street , Boston '

In [57]:
text.replace('1','')

'6 Bolton Avenue , Boston '

### 6.6.2 正则表达式

单条正则表达式即regex。   
Py内置的 **re 模块** 用于操作 **regex对象** 。


re模块提供的函数分为：     
 > 模式匹配     
 > 替换     
 > 切分     

例如，表示一个/多个空白字符的正则表达式为\s+ 。    
re模块中也有split函数，能够以正则表达式作为分隔符。

In [58]:
import re
text = 'This is     an\t odd \n text!'
re.split('\s+',text)

['This', 'is', 'an', 'odd', 'text!']

* **调用re.split( )时，首先编译正则表达式，然后再作为参数传入的文本上调用split( )。   
  可以用re.complie( )函数编译正则表达式，得到一个可以重用的regex对象，节省CPU周期。**

In [59]:
regex = re.compile('\s+')
regex.split(text)

['This', 'is', 'an', 'odd', 'text!']

* findall( ) 可以匹配文本中所有符合正则表达式的子串。   
 返回一个列表，元素为文本中所有符合正则表达式的子串。

In [60]:
text = 'This is my address: 16 Bolton Avenue, Boston'
re.findall('A\w+',text)

['Avenue']

In [61]:
re.findall('[A,a]\w+',text)

['address', 'Avenue']

和findall( ) 函数相关的两个函数为**match( ), search( )** .    
findall( )返回一列所有符合模式的子串，    
search( )仅返回第一处符合模式的子串，且返回结果为一个特殊类型的对象。

In [62]:
re.search('[A,a]\w+',text)

该对象不包含任何模式的子串，而是子串在字符串中的开始和结束位置。

In [63]:
search = re.search('[A,a]\w+',text)
search.start()

11

In [64]:
search.end()

18

In [65]:
text[search.start():search.end()]

'address'

match( )从字符串开头开始匹配；如果第一个字符就不匹配，就不会再搜索字符串内部，   
**如果没有找到任何匹配的子串，不会返回任何对象。**   
如果有返回内容，则返回对象与search( )相同。

In [66]:
re.match('[A,a]\w+',text)

## 6.7 数据聚合

### 6.7.1 GroupBy

* GroupBy通常指其内部机制——SPLIT-APPLY-COMBINE（分组-用函数处理-合并结果）过程。   
* 由三个阶段组成：     
 > 分组：将数据集分成多组     
 > 用函数处理：用函数处理每一组     
 > 合并：把不同组得到的结果合并起来      
 
### 6.7.2 示例

In [67]:
frame = pd.DataFrame({'color':['w','r','g','r','g'],
                     'object':['pen','pencil','pencil','ashtray','pen'],
                     'price1':[5.56,4.20,1.30,0.56,2.75],
                     'price2':[4.75,4.12,1.60,0.75,3.15]})
frame

  color   object  price1  price2
0     w      pen    5.56    4.75
1     r   pencil    4.20    4.12
2     g   pencil    1.30    1.60
3     r  ashtray    0.56    0.75
4     g      pen    2.75    3.15

要使用color列的组标签，计算price1列的均值，     
可以先获取到price1列，再调用groupby( )，用参数指定color列。

In [68]:
group = frame['price1'].groupby(frame['color'])
group

刚才得到的对象为GroupBy对象。刚才只是把计算需要的所有信息放在一起，即分组操作，把含有相同颜色的行分到同一个组里。   
** *调用GroupBy对象的groups属性，查看DF各行分组情况* **

In [69]:
group.groups

{'g': Int64Index([2, 4], dtype='int64'),
 'r': Int64Index([1, 3], dtype='int64'),
 'w': Int64Index([0], dtype='int64')}

In [70]:
group.mean()

color
g    2.025
r    2.380
w    5.560
Name: price1, dtype: float64

In [71]:
group.sum()

color
g    4.05
r    4.76
w    5.56
Name: price1, dtype: float64

### 6.7.3 等级分组

可以用多列，即用多个键，按照等级关系分组。

In [72]:
ggroup = frame['price1'].groupby([frame['color'],frame['object']])
ggroup.groups

{('g', 'pen'): Int64Index([4], dtype='int64'),
 ('g', 'pencil'): Int64Index([2], dtype='int64'),
 ('r', 'ashtray'): Int64Index([3], dtype='int64'),
 ('r', 'pencil'): Int64Index([1], dtype='int64'),
 ('w', 'pen'): Int64Index([0], dtype='int64')}

In [73]:
ggroup.sum()

color  object
g      pen        2.75
       pencil     1.30
r      ashtray    0.56
       pencil     4.20
w      pen        5.56
Name: price1, dtype: float64

可以按照多列数据或整个DF把数据分为几组。    
如果不想重复多次使用GroupBy对象，最方便的方法是一次把所有的分组依据和计算方法都指定好，无需定义任何中间变量。

In [74]:
frame[['price1','price2']].groupby(frame['color']).mean()

       price1  price2
color
g       2.025   2.375
r       2.380   2.435
w       5.560   4.750

In [75]:
frame.groupby(frame['color']).mean()

       price1  price2
color
g       2.025   2.375
r       2.380   2.435
w       5.560   4.750

## 6.8 组迭代

* GroupBy对象还支持迭代操作，可生成一系列由各组名称及其数据部分组成的元组。

In [76]:
for name,group in frame.groupby('color'):
    print(name)
    print(group)

g
  color  object  price1  price2
2     g  pencil    1.30    1.60
4     g     pen    2.75    3.15
r
  color   object  price1  price2
1     r   pencil    4.20    4.12
3     r  ashtray    0.56    0.75
w
  color object  price1  price2
0     w    pen    5.56    4.75

### 6.8.1 链式转换

用函数进行计算/操作时，不管各组如何得到及选取标准，最终结果不是Series就是DF，保留了索引系统和列名称。   
因此，在GroupBy过程中任何一个阶段都可以任意选择一列数据。

### 6.8.2 分组函数

有很多函数不是专门为GroupBy对象实现的，却适用于Series结构。
例如：用quantile计算分位数

In [77]:
group = frame.groupby('color')
group['price1'].quantile(0.6)

color
g    2.170
r    2.744
w    5.560
Name: price1, dtype: float64

**也可以自定义聚合函数，将其作为参数传给agg( )**

In [78]:
def ranging(series):
    return series.max()-series.min()
group['price1'].agg(ranging)

color
g    1.45
r    3.64
w    0.00
Name: price1, dtype: float64

In [79]:
group.agg(ranging)

       price1  price2
color
g        1.45    1.55
r        3.64    3.37
w        0.00    0.00

还可以同时使用多个聚合函数，把存放有表示聚合操作类型的数组传给agg。   
DF为其添加新列

In [80]:
group['price1'].agg(['mean','std',ranging])

        mean       std  ranging
color
g      2.025  1.025305     1.45
r      2.380  2.573869     3.64
w      5.560       NaN     0.00

## 6.9 高级数据聚合

transform( ) 和 apply( )函数，可以用来执行多种及很复杂的组操作。
假设想把下面的内容放在同一个DF中：

In [81]:
frame = pd.DataFrame({'color':['w','r','g','r','g'],
                     'price1':[5.56,4.20,1.30,0.56,2.75],
                     'price2':[4.75,4.12,1.60,0.75,3.15]})
frame

  color  price1  price2
0     w    5.56    4.75
1     r    4.20    4.12
2     g    1.30    1.60
3     r    0.56    0.75
4     g    2.75    3.15

In [82]:
sums = frame.groupby('color').sum().add_prefix('tot_')
sums

       tot_price1  tot_price2
color
g            4.05        4.75
r            4.76        4.87
w            5.56        4.75

In [83]:
pd.merge(frame,sums,left_on='color',right_index=True)

  color  price1  price2  tot_price1  tot_price2
0     w    5.56    4.75        5.56        4.75
1     r    4.20    4.12        4.76        4.87
3     r    0.56    0.75        4.76        4.87
2     g    1.30    1.60        4.05        4.75
4     g    2.75    3.15        4.05        4.75

可以用merge把聚合操作的计算结果添加到DF对象每一行。     
也可以用transform实现操作，它还可以根据DF对象每一行的关键字显示聚合结果。

In [84]:
frame.groupby('color').transform(np.sum).add_prefix('tot_')

   tot_price1  tot_price2
0        5.56        4.75
1        4.76        4.87
2        4.05        4.75
3        4.76        4.87
4        4.05        4.75

* 由此可见，transform更适合用作聚合操作，但是它对参数有特定要求：   
 作为参数的函数必须生成一个标量（聚合），因为只有这样才能进行广播。    
 
* apply适用于执行更一般的GroupBy操作，此操作完全实现了SPLIT-APPLY-COMBINE机制。   
 它把对象分为几部分之后，再用函数处理每一部分，各步骤之间用链式方法连接在一起。

In [85]:
frame = pd.DataFrame({'color':['w','k','w','w','k','k'],
                      'status':['up','up','down','down','down','up'],
                      'value1':[12.33,14.55,22.34,27.84,23.40,18.33],
                      'value2':[11.23,31.80,29.99,31.18,18.25,22.44]})
frame

  color status  value1  value2
0     w     up   12.33   11.23
1     k     up   14.55   31.80
2     w   down   22.34   29.99
3     w   down   27.84   31.18
4     k   down   23.40   18.25
5     k     up   18.33   22.44

In [86]:
frame.groupby(['color','status']).apply(lambda x: x.max())

             color status  value1  value2
color status
k     down       k   down   23.40   18.25
      up         k     up   18.33   31.80
w     down       w   down   27.84   31.18
      up         w     up   12.33   11.23

In [87]:
frame.rename(index=str)

  color status  value1  value2
0     w     up   12.33   11.23
1     k     up   14.55   31.80
2     w   down   22.34   29.99
3     w   down   27.84   31.18
4     k   down   23.40   18.25
5     k     up   18.33   22.44